app/controllers/api/transactions_controller.rb

SELECT  "transactions".* FROM "transactions" WHERE "transactions"."user_id" = $1 AND "transactions"."symbols" = $2 LIMIT $3  [["user_id", 20], ["symbols", "T"], ["LIMIT", 1]]
UPDATE "users" SET "balance" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["balance", 0], ["updated_at", "2020-09-21 20:44:09.925789"], ["id", 17]]
UPDATE "transactions" SET "shares" = $1, "updated_at" = $2 WHERE "transactions"."id" = $3  [["shares", 2176], ["updated_at", "2020-10-05 17:50:48.041191"], ["id", 71]]
UPDATE "transactions" SET "shares" = $1, "updated_at" = $2 WHERE "transactions"."id" = $3  [["shares", 0], ["updated_at", "2020-10-17 21:56:04.404080"], ["id", 70]]
DELETE FROM "transactions" WHERE "transactions"."id" = $1  [["id", 72]]
INSERT INTO "transactions" ("purchase_price", "shares", "created_at", "updated_at", "user_id", "symbols") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["purchase_price", 32], ["shares", 2], ["created_at", "2020-09-17 15:02:49.057172"], ["updated_at", "2020-09-17 15:02:49.057172"], ["user_id", 16], ["symbols", "T"]]
---
    def create
        if params[:transaction][:balance].to_f >= 0 #the params transactions will come from the container form
            @user_transaction = Transaction.where(user_id: params[:transaction][:user_id])
            #find all the users transaction

            @transaction_needed_to_update = @user_transaction.find_by(symbols: params[:transaction][:symbols])
            #within the user data find only the transactions with the matched symbol
            if @transaction_needed_to_update #IF able to find the transaction thats needed to be updated
                updated_transaction = @transaction_needed_to_update.shares + params[:transaction][:shares].to_i
                if updated_transaction > 0
                    @transaction_needed_to_update.update(shares: updated_transaction)
                    @transaction = @transaction_needed_to_update
                    render :show
                elsif updated_transaction == 0
                    @transaction_needed_to_update.update(shares: updated_transaction)
                    @transaction = @transaction_needed_to_update
                    @transaction_needed_to_update.destroy
                    render :show
                else
                    render json:["transaction unable to be completed"], status: 422
                end
            else
                @transaction = Transaction.new(transactions_param)
                if @transaction.shares >= 0
                    @transaction.save

SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = $1  [["user_id", 16]]
---
    def index
        @transactions = Transaction.where(user_id: params[:transaction][:user_id].to_i)

SELECT  "transactions".* FROM "transactions" WHERE "transactions"."user_id" = $1 AND "transactions"."symbols" = $2 LIMIT $3  [["user_id", 20], ["symbols", "T"], ["LIMIT", 1]]
---
    def show
        #
        @transactions = Transaction.where(user_id: params[:transaction][:user_id].to_i)
        @transaction = @transactions.find_by(symbols: params[:transaction][:symbol])