app/controllers/api/users_controller.rb

  def create
    #
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("email", "first_name", "last_name", "balance", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update #USED TO UPDATE BALANCE AMT WHEN USER MAKES TRANSACTION
    @user = User.find_by(id: params[:transaction][:user_id])
    @user_transactions = Transaction.where(user_id: params[:transaction][:user_id])
    @transaction_needed_to_update = @user_transactions.find_by(symbols: params[:transaction][:symbols])
    if !@transaction_needed_to_update && params[:transaction][:shares].to_i < 0
        #if there are not transaction of the stock and the user didn't make any transaction
      render :show
    elsif @transaction_needed_to_update && @transaction_needed_to_update.shares + params[:transaction][:shares].to_i < 0
        #if there is the transaction of the stock but not enough shares (negative)
      render :show
    else
      if params[:transaction][:balance].to_f >= 0
        #will get the balance in the frontend (CALCULATED AMOUNT)
      @user.update(balance: params[:transaction][:balance].to_f)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
SELECT  "transactions".* FROM "transactions" WHERE "transactions"."user_id" = $1 AND "transactions"."symbols" = $2 LIMIT $3  [["user_id", 17], ["symbols", "T"], ["LIMIT", 1]]
UPDATE "transactions" SET "shares" = $1, "updated_at" = $2 WHERE "transactions"."id" = $3  [["shares", 2], ["updated_at", "2020-09-27 20:32:19.452321"], ["id", 65]]
UPDATE "users" SET "balance" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["balance", 0], ["updated_at", "2020-09-21 20:44:09.925789"], ["id", 17]]