app/controllers/api/watchlists_controller.rb

    def create
            @user_watchlist = Watchlist.where(user_id: params[:watchList][:user_id])
            #find all the users watchlist

            @watchlist_needed_to_update = @user_watchlist.find_by(symbols: params[:watchList][:symbols])
            #within the user data find only the watchlist with the matched symbol
            if @watchlist_needed_to_update #IF able to find the watchlist thats needed to be updated
                render json:["Already added to watchlist"], status: 422
            else
                @watchlist = Watchlist.new(watchlist_param)
                if @watchlist.save
---
SELECT  "watchlists".* FROM "watchlists" WHERE "watchlists"."user_id" = $1 AND "watchlists"."symbols" = $2 LIMIT $3  [["user_id", 21], ["symbols", "T"], ["LIMIT", 1]]
INSERT INTO "watchlists" ("user_id", "symbols", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 21], ["symbols", "T"], ["created_at", "2020-10-21 17:16:23.251514"], ["updated_at", "2020-10-21 17:16:23.251514"]]

    def index
        @watchlists = Watchlist.where(user_id: params[:watchList][:user_id].to_i)
---
SELECT "watchlists".* FROM "watchlists" WHERE "watchlists"."user_id" = $1  [["user_id", 21]]

    def show
        @watchlists = Watchlist.where(user_id: params[:watchList][:user_id].to_i)
        @watchlist = @watchlists.find_by(symbols: params[:watchList][:symbol])
---
SELECT  "watchlists".* FROM "watchlists" WHERE "watchlists"."user_id" = $1 AND "watchlists"."symbols" = $2 LIMIT $3  [["user_id", 21], ["symbols", "AAPL"], ["LIMIT", 1]]

    def destroy
            @user_watchlist = Watchlist.where(user_id: params[:watchList][:user_id])
            #find all the users watchlist

            @watchlist = @user_watchlist.find_by(symbols: params[:watchList][:symbols])
            #within the user data find only the watchlist with the matched symbol
            if @watchlist #IF able to find the watchlist thats needed to be updated
                @watchlist.destroy
---
SELECT  "watchlists".* FROM "watchlists" WHERE "watchlists"."user_id" = $1 AND "watchlists"."symbols" = $2 LIMIT $3  [["user_id", 21], ["symbols", "SNAP"], ["LIMIT", 1]]
DELETE FROM "watchlists" WHERE "watchlists"."id" = $1  [["id", 5]]